In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
/*
SCD (Slowly Changing Dimension) is a method used in databases to track and preserve historical changes in data over time.

Why We Use SCD

Track Historical Data: We want to retain older versions of our data for accurate historical analysis and trend reporting (e.g., how many sales happened when the customer had a different address).

Data Accuracy: Ensures that updates to dimension data (like a last name change) wonâ€™t override previous valid data in a way that confuses analysis.

Simplify Reporting and Analytics: Makes it easier for analysts to query the data, knowing they can trust the historical records.

Main Types of SCD

Type 1: Overwrite

Type 2: Add New Record

Type 3: Add New Attribute
*/

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [5]:
%%sql
#Type 1
drop table if exists dim_product_type1;
CREATE TABLE dim_product_type1 ( product_id INT PRIMARY KEY,
product_title VARCHAR(255), category VARCHAR(100), brand VARCHAR(100) );

INSERT INTO dim_product_type1 (product_id, product_title, category, brand) VALUES (101, 'Amazon Echo Dot 3rd Gen', 'Smart Speakers', 'Amazon');

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
1 rows affected.

[]

In [6]:
%%sql
select * from dim_product_type1

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(101, 'Amazon Echo Dot 3rd Gen', 'Smart Speakers', 'Amazon')]

In [8]:
%%sql
# HERE WE LISTED A PRODUCT BUT LISTED THE NAME WORNGLY SO WE NEED TO UPDATE IT 
UPDATE dim_product_type1 SET product_title = 'Amazon Echo Dot (3rd Gen)' WHERE product_id = 101;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [10]:
%%sql
select * from dim_product_type1

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(101, 'Amazon Echo Dot (3rd Gen)', 'Smart Speakers', 'Amazon')]

In [11]:
%%sql
-- this is type one scd there will be no data saving we just need to overwrite it

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [16]:
%%sql
# Type 2
drop table if exists dim_seller_type2;
CREATE TABLE dim_seller_type2 ( seller_key INT PRIMARY KEY,
seller_id INT,
seller_name VARCHAR(255), 
store_location VARCHAR(255), 
effective_date DATE,
end_date DATE,
is_current BOOLEAN
);

INSERT INTO dim_seller_type2 (seller_key, seller_id, seller_name, store_location, effective_date, end_date, is_current) 
VALUES (1, 501, 'Best Sellers Inc.', 'Seattle, WA', '2022-01-01', NULL, TRUE);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
1 rows affected.

[]

In [17]:
%%sql
select * from dim_seller_type2;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), None, 1)]

In [18]:
%%sql
UPDATE dim_seller_type2 SET end_date = '2023-01-15', is_current = FALSE WHERE seller_id = 501 AND is_current = TRUE;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [19]:
%%sql
select * from dim_seller_type2;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), datetime.date(2023, 1, 15), 0)]

In [20]:
%%sql
INSERT INTO dim_seller_type2 (seller_key, seller_id, seller_name, store_location, effective_date, end_date, is_current) VALUES (2, 501, 'Best Sellers Inc.', 'Los Angeles, CA', '2023-01-15', NULL, TRUE);

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[]

In [21]:
%%sql
# Just like that we add the new records everytime when the user or anything changes 
# We recorded the end_date and added the new one and the new ones end_date is none until again changes
select * from dim_seller_type2;

 * mysql+mysqlconnector://root:***@localhost/mydb
2 rows affected.

[(1, 501, 'Best Sellers Inc.', 'Seattle, WA', datetime.date(2022, 1, 1), datetime.date(2023, 1, 15), 0),
 (2, 501, 'Best Sellers Inc.', 'Los Angeles, CA', datetime.date(2023, 1, 15), None, 1)]

In [22]:
%%sql
# Type 3
drop table if exists dim_product_type3;
CREATE TABLE dim_product_type3 ( product_id INT PRIMARY KEY,
product_title VARCHAR(255), current_category VARCHAR(100), previous_category VARCHAR(100)
);

INSERT INTO dim_product_type3 (product_id, product_title, current_category, previous_category) VALUES (201, 'Amazon Fire TV Stick', 'Streaming Devices', NULL);

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.
0 rows affected.
1 rows affected.

[]

In [23]:
%%sql
select * from dim_product_type3;

 * mysql+mysqlconnector://root:***@localhost/mydb
1 rows affected.

[(201, 'Amazon Fire TV Stick', 'Streaming Devices', None)]

In [ ]:
%%sql
# Here we are Updating the new one and in the type 3 we only keep the old two past datas and dro
UPDATE dim_product_type3 SET previous_category = current_category, current_category = 'Media Players' WHERE product_id = 201;